# Imports

In [1]:
#tabular manipulation
import numpy as np
import pandas as pd

#visualization
import matplotlib.pyplot as plt
import seaborn as sns

#custom modules
import acquire
import prepare
from env import host, user, password

#remove warnings
import warnings
warnings.filterwarnings("ignore")

# Acquire using .txt file

In [2]:
#custom function from acquire.py
df = acquire.get_data("anonymized-curriculum-access-07-2021.txt", ['date', 'time', 'endpoint', 'user_id', 'cohort_id', 'source_ip'])

In [3]:
#take a look at the data
df.head()

,date,time,endpoint,user_id,cohort_id,source_ip
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8.0,97.105.19.61
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8.0,97.105.19.61
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22.0,97.105.19.61

In [4]:
#look at size, dtypes, nulls
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1018810 entries, 0 to 1018809
Data columns (total 6 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   date       1018810 non-null  object
 1   time       1018810 non-null  object
 2   endpoint   1018809 non-null  object
 3   user_id    1018810 non-null  int64
 4   cohort_id  965313 non-null   float64
 5   source_ip  1018810 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 46.6+ MB

In [5]:
df.isnull().sum()

date             0
time             0
endpoint         1
user_id          0
cohort_id    53497
source_ip        0
dtype: int64

# Acquire using SQL database

In [6]:
#custom function from acquire.py
df2 = acquire.get_sql_data()

In [7]:
#take a look
df2.head()

,date,time,path,user_id,cohort_id,ip,id,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
0,2018-01-26,09:55:03,/,1,8.0,97.105.19.61,8.0,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1.0
1,2018-01-26,09:56:02,java-ii,1,8.0,97.105.19.61,8.0,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1.0
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1,8.0,97.105.19.61,8.0,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1.0
3,2018-01-26,09:56:06,slides/object_oriented_programming,1,8.0,97.105.19.61,8.0,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1.0
4,2018-01-26,09:56:24,javascript-i/conditionals,2,22.0,97.105.19.61,22.0,Teddy,#teddy,2018-01-08,2018-05-17,2018-01-08 13:59:10,2018-01-08 13:59:10,None,2.0

In [8]:
#look at size, nulls and dtypes
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900223 entries, 0 to 900222
Data columns (total 15 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        900223 non-null  object
 1   time        900223 non-null  object
 2   path        900222 non-null  object
 3   user_id     900223 non-null  int64
 4   cohort_id   847330 non-null  float64
 5   ip          900223 non-null  object
 6   id          847330 non-null  float64
 7   name        847330 non-null  object
 8   slack       847330 non-null  object
 9   start_date  847330 non-null  object
 10  end_date    847330 non-null  object
 11  created_at  847330 non-null  object
 12  updated_at  847330 non-null  object
 13  deleted_at  0 non-null       object
 14  program_id  847330 non-null  float64
dtypes: float64(3), int64(1), object(11)
memory usage: 103.0+ MB

In [9]:
df2.isnull().sum()

date               0
time               0
path               1
user_id            0
cohort_id      52893
ip                 0
id             52893
name           52893
slack          52893
start_date     52893
end_date       52893
created_at     52893
updated_at     52893
deleted_at    900223
program_id     52893
dtype: int64

### Takeaways from Acquire:
- .txt file appears to have:
    - 6 columns
    - object, int, float datatypes
    - many nulls in 'cohort_id'
    
    <br>
    
- SQL dataframe appears to have:
    - 15 columns
    - float, int, object datatypes
    - nulls in several columns
    - no data in 'deleted_at' column (possibly delete)

**we have decided to use SQL data**

<hr style="border:2px solid black"> </hr>

# Prepare

In [10]:
df = prepare.prep_df(df2)

In [11]:
df.head()

,time,path,user_id,cohort_id,ip,name,slack,start_date,end_date,created_at,updated_at,program_id
date,,,,,,,,,,,,
2018-01-26,2021-07-20 09:55:03,/,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,1.0
2018-01-26,2021-07-20 09:56:02,java-ii,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,1.0
2018-01-26,2021-07-20 09:56:05,java-ii/object-oriented-programming,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,1.0
2018-01-26,2021-07-20 09:56:06,slides/object_oriented_programming,1,8.0,97.105.19.61,Hampton,#hampton,2015-09-22,2016-02-06,2016-06-14 19:52:26,2016-06-14 19:52:26,1.0
2018-01-26,2021-07-20 09:56:24,javascript-i/conditionals,2,22.0,97.105.19.61,Teddy,#teddy,2018-01-08,2018-05-17,2018-01-08 13:59:10,2018-01-08 13:59:10,2.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 900223 entries, 2018-01-26 to 2021-04-21
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time        900223 non-null  datetime64[ns]
 1   path        900222 non-null  object
 2   user_id     900223 non-null  int64
 3   cohort_id   847330 non-null  float64
 4   ip          900223 non-null  object
 5   name        847330 non-null  object
 6   slack       847330 non-null  object
 7   start_date  847330 non-null  datetime64[ns]
 8   end_date    847330 non-null  datetime64[ns]
 9   created_at  847330 non-null  datetime64[ns]
 10  updated_at  847330 non-null  datetime64[ns]
 11  program_id  847330 non-null  float64
dtypes: datetime64[ns](5), float64(2), int64(1), object(4)
memory usage: 89.3+ MB